# Introdução ao SQL

## Recapitulando

Comandos apresentados na aula passada.

## Objetivos

Na aula de hoje, veremos comandos para ordenar resultados e para manipular datas e strings.

Ao final desta aula o aluno deverá conhecer:

- O comando ORDER BY;
- Como utilizar a função CASE em uma consulta.
- Como acessar e manipular datas e horários;
- Como manipular strings;

## ORDER BY

**Ascending:** Selecione todos os dados da tabela customers e ordene a tabela em ordem crescente do nome dos contatos.

    SELECT * from customers
    ORDER BY contact_name;

**Descending:** Escolha apenas as colunas company_name e city da tabela customers e ordene em pelo nome da cidade em ordem decrescente.

    SELECT company_name, city 
    FROM customers
    ORDER BY city DESC;

## CASE

### CASE WHEN ... THEN ... END
Crie uma coluna `prioridade` que tenha o valor `Priority 1` quando o contact_title for `Owner`

    SELECT *, 
    CASE WHEN contact_title = 'Owner' THEN 'Priority 1'
    END AS prioridade
    FROM customers;

### CASE WHEN ... THEN ... WHEN ... THEN ...ELSE ... END
Popule a coluna `prioridade` com valor `Priority 2` quando o contact_title for `Sales Manager`, `Priority 3` para `Marketing Manager` e `Priority 4` para outros cargos.

    SELECT contact_title, 
    CASE 
    WHEN contact_title = 'Owner' THEN 'Priority 1' 
    WHEN contact_title = 'Sales Manager' then 'Priority 2'
    WHEN contact_title = 'Marketing Manager' then 'Priority 3'
    ELSE 'Priority 4'
    END as prioridade
    FROM customers;

    SELECT contact_title, 
    CASE 
    WHEN contact_title LIKE '%Owner%' THEN 'Priority 1' 
    WHEN contact_title Like '%Manager%' then 'Priority 2'
    WHEN contact_title like '%Sales%' then 'Priority 3'
    ELSE 'Priority 4'
    END as prioridade
    FROM customers;

## TIME FUNCTIONS

### CURRENT_DATE
Que dia é hoje?

    SELECT CURRENT_DATE;

### CURRENT_TIME
Que horas são?

    SELECT CURRENT_TIME;

### NOW
Tudo junto!

    SELECT NOW();

### DATE_PART

**Dia, mês e ano.**

    SELECT DATE_PART('year', now())
    
    - 'month'
    - 'day'
    - 'hour'
    - 'minute'
    - 'second'

Selecione o dia de nascimento de todos os empregados.

    SELECT first_name, birth_date, date_part('day', birth_date) FROM employees;

    SELECT first_name, birth_date, EXTRACT(day from birth_date) FROM employees;

Selecione todos os empregados que foram contratados em 1993.

    SELECT * from employees
    WHERE date_part('year', hire_date) = 1993

### DATE_TRUNC
**Dia, mês e ano.**

    SELECT first_name, birth_date, DATE_TRUNC('day', birth_date) FROM employees;

**Obs:** Sempre retorna um timestamp!

### Operações com data/hora

    SELECT current_date + 35

#### AGE

Calcule 

    SELECT birth_date, ((current_date - birth_date) / 365.25)::integer FROM employees;

    SELECT birth_date, AGE(birth_date) FROM employees;
    
    Notação ::integer representa o cast desse valor para inteiro.

## Funções de string

### CONCAT ou ||
Junta pedaços de texto num único output.

Ex: Crie um campo com o primeiro e último nomes dos empregados.

    SELECT concat('Leopoldo', ' Vasconcelos');

    SELECT 'Rubisneide' || ' Antonieta';

    SELECT first_name || ' ' || last_name FROM employees;

### UPPER e LOWER
Transforma todos a caixa de todos os caracteres.

EX: Traga o nome dos funcionários em letras maiusculas.

    SELECT 'GaBriel', LOWER('GaBriel'), UPPER('GaBriel');

    SELECT first_name, LOWER(first_name), UPPER(first_name) from employees;

### TRIM 
Remove espaços em branco.

     SELECT 
     '           teste              ' original, 
     TRIM('           teste              ') trim_total,
     RTRIM('           teste              ') as trim_direita,
     LTRIM('           teste              ') trim_esquerda;
     
     -- trim não remove espaço entre palavras
     Select trim('   abc   def   ')

### SUBSTRING
Retorna um pedaço de texto num intervalo determinado.

    SELECT SUBSTRING('E ai turma 767!', 1, 4)
    
    --retorna 'E ai'
    
    SELECT SUBSTRING('E ai turma 767!', 5, 6);
    
    -- retorna turma

**RIGHT**: Seciona o número de caracteres, contando da direita.

    SELECT RIGHT('E ai turma 767!', 4);
    -- retorna '767!

**LEFT**: Seciona o número de caracteres, contando da esquerda.

    SELECT LEFT('E ai turma 767!', 4);
    -- retorna 'E ai'

### POSITION
Retorna a posição de um caracter ou sequência.

    SELECT Position('G' in 'Guilherme');

    SELECT Position('e' in 'Guilherme');

    SELECT Position('lhe' in 'Guilherme');

    SELECT position('abc' in 'abfdghr~ijfabcojkgrj');

### Replace
Troca uma sequência de caracteres por outra.

Ex: Troque a palavra 'Sales' por 'Vendas' no cargo dos funcionários.

    SELECT replace('André Picolé', 'ré', 'e...');

    SELECT replace('André Picolé', 'é', 'e...');

    SELECT title, replace(title, 'Sales', 'Vendas') FROM employees;

# Exercícios

Executar as consultas abaixo em SQL e enviar o arquivo sql para o e-mail do professor da seguinte forma:

E-mail: williamtx1987@gmail.com

Assunto: 767_firstname_lastname_aula04-p2

Escrever um comentário antes de cada comando indicando a qual exercício ele se refere.

### Q1

Selecione os id's únicos de territórios da tabela employee_territories e ordene em ordem decrescente.

### Q2

Selecione da tabela empolyees (não esqueça de nomear as colunas criadas):
1. O nome completo dos empregados em ordem alfabética;
1. O nome completo dos empregados com o respectivo titulo em ordem decrescente;
1. Os sobrenomes distintos dos empregrados;
1. O ano de nascimento dos empregados usando funções de tempo;
1. O ano de nascimento dos empregados usando funções de string;
1. A idade atual dos empregados em ordem decrescente;
1. A idade que os empregados tinham quando foram contratados em ordem crescente;
1. Quem é e qual a idade do empregado mais velho?
1. Qual a pessoa mais jovem que foi contratada?
1. Crie uma coluna que mapeie os cargos dos empregados com a posição hierárquica na lista, sendo 1 o mais alto.
1. O tempo de empresa dos respectivos empegados;

### Q3

Selecione da tabela products:
1. Os três produtos mais caros com seus respectivos preços;
1. Os 10 produtos com estoque mais baixo (diferentes de 0) com suas respectivas quantidades;
1. Os 5 produtos com maior valor agregado (valor total) atualmente em estoque;
1. Produtos com mais de 100 unidades no estoque ou valor unitário inferior 15;

### Q4

Selecione da tabels orders:
1. O primeiro nome do destinatário da entrega (ship_name);
1. O tempo (em dias) entre a compra e a entrega;
1. Os cinco fretes mais caros ordenados pelo tempo de entrega do decrescente (sem dados nulos);
1. Os cinco fretes com maior tempo de entrega ordenados pelo valor decrescente (sem dados nulos);
1. Os 3 fretes mais baratos do Brasil.
1. Uma tabela com as três primeiras letras do nome do pais, o tempo de entrega e o frete ordenados em ordem crescente.